# Get Method (Element) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Alignment..::..Get Method (Element)
Alignment Class See Also
---
Returns an Alignment object given a Revit alignment element.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public static Alignment Get(
	Element alignmentElement
)
```

Visual Basic
---
```text
Public Shared Function Get ( _
	alignmentElement As Element _
) As Alignment
```

Visual C++
---
```text
public:
static Alignment^ Get(
	Element^ alignmentElement
)
```

# ### Parameters
alignmentElement
    Type: Autodesk.Revit.DB..::..ElementThe alignment element.
# ### Return Value
An Alignment for this element, or null if none found.
# See Also
Alignment Class
Get Overload
Autodesk.Revit.DB.Infrastructure Namespace